{
  "notes": [
    {
      "episode": "1",
      "name": "Book 1",
      "title": "Bars of Interpretations.",
      "details": "The root of modern evangelism and televangelists. It is the root of all religions: Protestantism and Catholicism. It has become the root of Sodom and Gomorrah. It will be the root of a one world church and a one world government and most assuredly the root of the mark of the beast-666, Revelation 13:13-18. This will finally bring the destruction of Rome and the rest of the world.",
      "date": "3/16/2023",
      "place": "Ghana",
      "duration": "48",
      "id": 1
    },
    {
      "episode": "1",
      "name": "Book 2",
      "title": "Mamba Snake At The Jordan.",
      "details": "Pentecostalism is the only religious body that is presently employed in this satanic task. Is that. She was ordained to fulfill this prophecy. She will be \\ninstrumental in bringing the Mark of the beast from Rome to all people whose names are not in the lambs book of life (Revelation 13:13-18, Revelation 17:8). \\nSatan‘s evangelization is almost completed. God‘s last revival and evangelization comes by another return of Pentecost. It will accompany great signs, wonders \\nand miracles in creative acts of power. This will be the true fulfillment of Mark 11:23. \\nTwo great men are instruments of Satan and are viciously keeping the vision of Satan‘s world evangelization alive. They are keeping word of faith \\nrevival alive. They are K. Copeland and P. Crouch, who was associated with Mr. Hagin and Oral Roberts. Crouchs‘ network T.B.N. accommodates most of \\nSatan‘s Televangelists. Benny Hinn is the most popular and is imitating the outpouring of the Holy Spirit that is about to come to the people of God. Such men \\nare known by their fruits: ―Ye shall know them by their fruits",
      "date": "3/16/2023",
      "place": "Ghana",
      "duration": "180",
      "id": 2
    },
    {
      "episode": "1",
      "name": "Book 3",
      "title": "False Anointed Ones.",
      "details": "So they sought the return of Pentecost on the basis of Joel 2: 23-26 and they knew that would come by the Latter Rain, outpouring of the Spirit. Now \\none thing that is important here: they did not have enough knowledge of the plan of God or the program of God to have this return of Pentecost. They went \\naccording to their own knowledge, their own understanding; they did their best. They were great men; they were wonderful men, even like Martin Luther and \\nJohn Wesley. Great men, they were sincere men. \\nNow Luther was a Trinitarian, believing in three gods and he was even involved in the catechism from the Catholic church, showing you how dark the \\nhour was. Wesley took some of the Catholic doctrine and he brought it over too. These men coming out of the Catholic, Lutheran and Methodist church were \\nTrinitarians. The revelation of ―one God‖ had not yet come to them. (Think of how dark that hour was.) They were Trinitarians, believing that God was three \\ngods! A Father, a Son and the Holy Ghost. You pray to the Father a little bit, then you pray to the Son a little bit, then you pray to the Holy Ghost a little bit, and \\nif you feel that the Father is jealous then you come back to the Father and start worshiping Him. It becomes confusing to the mind. \\nNow we believe in Father, Son, and Holy Ghost but we do not believe that they are three gods. We believe in one God (Saint John 4:24) and we believe \\nthat God was manifested in three different offices or attributes.",
      "date": "2/15/2023",
      "place": "Ghana",
      "duration": "120",
      "id": 3
    },
    {
      "episode": "1",
      "name": "Book 4",
      "title": "Five Major Doctrinal Divisions - Message Believers.",
      "details": "In the Old Testament, He was Father of Israel. He took a bodily form and came down on the earth and He was the Son. Through His death, burial and \\nresurrection, He came back on the day of Pentecost as the Holy Ghost—one God.\\nSo these were great men, and (I want to stress here that in 1906,) they did receive a genuine experience of the Holy Ghost. I will even venture to call it \\n(like the prophet called it) the baptism of the Holy Ghost. So they did receive the baptism of the Holy Ghost in 1906. They received an outpouring in 1906 and \\nthey received the gifts of the Spirit.",
      "date": "1/14/2023",
      "place": "Ghana",
      "duration": "59",
      "id": 4
    },
    {
      "episode": "1",
      "name": "Book 5",
      "title": "Seventh Seal / Seven Thunders Two Schools of Thought.",
      "details": "This last age started with the fires of a Pentecostal revival and they organized it right back. Instead of taking the Word they took their \\nown ideas and did just what every age has done--substituted the manual for the Word…They are second generation Pentecostals and since God doesn't have \\ngrandchildren they are just children of their fathers, known by their creeds and form of worship. They can talk about what used to be, but they can't produce it. \\nOnce they had the lightning but about all that is left is the thunder. But let them talk to you about the glories of their movement. They will say, \\\"Yes sir, I want \\nyou to know that this is a move that no man started. It came spontaneously. The Spirit fell all over the world. Yes sir, we got what they had at Pentecost. This was \\nnot of men but of God.\\\" THEN WHY DIDN'T THEY KEEP IT THAT WAY? IF GOD STARTED IT HOW COME GOD COULDN'T KEEP IT AND FINISH IT? If \\nGod didn't write a handbook of creeds and formulas and dogmas to start it, then what right did they have to do that? (Smyrnaean Church Age - Church Age \\nBook Cpt.).",
      "date": "3/16/2023",
      "place": "Ghana",
      "duration": "55",
      "id": 5
    },
    {
      "episode": "1",
      "name": "Booklet 1",
      "title": "Booklet 1 title",
      "details": "Booklet 1 details",
      "date": "3/16/2023",
      "place": "Ghana",
      "duration": "10",
      "id": 6
    },
    {
      "episode": "1",
      "name": "Tract 1",
      "title": "Tract 1 title",
      "details": "Tract 1 details",
      "date": "3/16/2023",
      "place": "Ghana",
      "duration": "5",
      "id": 7
    },
    {
      "episode": "1",
      "category": "books",
      "name": "book 6",
      "title": "30 of 16 MY SOUL'S INVENTORY - Internet Obsession CelL Phone  Addiction Bro Bruce 10 08 16.pdf",
      "details": "\n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   1 \nMy Soul’S Inventory  \n  \n(Internet Obsession & Cell Phone Addiction) \n \n30 OF 16 PREACHED BY BRO. DALTON Bruce AT BETHEL, FREEPORT 10/0/2016     \n \n \nThank You, Holy Father!  Thank You, Holy Spirit!  Thank You so much for Your wonderful anointing, \nwonderful  Spirit  in  our  midst!  We  give  You  the  glory.  Lift  your  right  hand  to  him  in  acknowledgement,  in \nthankfulness, our gratitude to Him, welcoming His presence, His word and the salvation that He has granted us, \nthe grace, the faith, the Spirit.  Thank You, Holy Father!  We come as the church of living God, locally, and  I \ncan  see  the  hands  abroad  lifted  unto  you  forming, oh  Lord, one  unity,  one  body,  one  people, bringing praise \nunto you. While the world lieth in wickedness, You have a certain number preserved from sin and we give You \nthe  glory  and  we  worship  You  as God, returning  the  praises  and  the  honor  and  the  glory.  If nobody  wants  to \nworship You, we will worship You.  We give Him the praise.  Thank You. Thank You. Thank You. Thank You. \nThank You for eternal Life. Thank You for Your Word.  Bless Your people tonight, home and abroad. Bless the \nWord  and  the  lips of  clay  that  will  speak.  In  the  Name  of  Jesus  Christ  we  pray  with  thanksgiving  and  the \ncongregation  say  amen. [Congregation  says,  “Amen!”] One  more  time. [Congregation  says,  “Amen!”] Now \nfor  another  time  we  all  say, “Amen!” [Congregation  says,  “Amen!”] Thank  You  so  very  much, oh  Lord,  for \nYour people. \n \nI read tonight. Everybody is familiar with this. And over here you can listen to Revelation 3:14. \n \n \nRevelation 3:14-22 <And  unto  the  angel  of  the  church  of  the  Laodiceans  write;  These  things  saith  the \nAmen, the faithful and true witness, the beginning of the creation of God; \nI know thy works, that thou art neither cold nor hot: I would thou wert cold or hot. \nSo then because thou art lukewarm, and neither cold nor hot, I will spue thee out of my mouth. \nBecause  thou  sayest,  I  am  rich,  and  increased  with  goods,  and  have  need  of  nothing;  and  knowest  not \nthat thou art wretched, and miserable, and poor, and blind, and naked:  \nI counsel thee to buy of me gold tried in the fire, that thou mayest be rich; and white raiment, that thou \nmayest be  clothed, and [that] the shame of thy nakedness do not appear; and anoint thine eyes with eyesalve, \nthat thou mayest see. \nAs many as I love, I rebuke and chasten: be zealous therefore, and repent. \nBehold, I stand at the door, and knock: if any man hear my voice, and open the door, I will come in to \nhim, and will sup with him, and he with me. \nTo  him  that  overcometh  will  I  grant  to  sit with  me  in  my  throne,  even  as  I  also  overcame,  and  am  set \ndown with my Father in his throne. \nHe that hath an ear, let him hear what the Spirit saith unto the churches.> \n \n \nMay  the  Lord  add  a  blessing  to  the  reading  of  His  holy  words. Thank  the  Lord.  We  are happy  for  our \ngathering on a Wednesday night.  Yes, we thank the Lord greatly for the words of life that He brought unto us \non Inventory of the Soul.  I believe that it went home to a lot of people who are trying to examine themselves.  \nIt is also written, “ \n \n \nII Corinthians 13:5 <Examine yourselves, whether ye be in the faith.> \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   2 \n \n \nYes.    So, there  is  a  scripture  for  inventory  and  that  is  self  examination.  So, I  am  back  on  the  same \nsubject again on inventory of the soul.  It will carry a subtitle, but we are here again and we are thankful to the \nLord  for  being  gathered.  I  see  almost  every  seat  filled  with expectation. I  can  feel  the  expectation.  Yes, and \nmay the Lord bless each one of you for your efforts in coming here tonight to hear the precious words of God.  \nHe never failed us yet.  We are a blessed people. \n \n \n \n\n[p1]\n\nFLOW OF THE SPIRIT \n \nI don’t know when we ever had a meeting that was bound.  I cannot recall.  In former years I remember \nthat  it  was  like  brass  in  certain  services.    Something  we  were doing  wrong.  Maybe  not knowing  how  to \napproach  the  Lord  or  how  to  behave  ourselves  in  the  presence  of  the Lord.  But  then  as  we went along, we \nlearned how  to woo  the  Spirit  of  the  Lord  by  setting  the  church  in  order.  Yes, it  took  many  years.  Now  the \nbrothers  overseas are  overwhelmed  with  the  transcribed  message  of “Church  Order, Why?” and  they  are \nblessed.  From the time it dropped there, they started establishing that message in Africa and India.  Yes. That \ngave  them  an  understanding of  why  the  Spirit  of  the  Lord  flows in Bethel,  because  that  was  the  question  all \nalong, “How  come,  Brother  Bruce, you  could  hold  those  people  on  their  seats  for  all  that  time?  We  want  to \nknow  the  secret.”  Yes. “We  noticed  that  people  would  not  get  up  from  their  seats, no matter  how  long the \nmeeting takes, except just a few who have problems.” And they want to find out what the secret is of this and \nthey look at everybody here through the congregation, and they are blessed.  And now they are proclaiming this \nas the example church of the world and a church set in order. \n \nNow, there  is  much  that  we  could  say  about  the  church  being  set  in  order.  Brother  Branham spoke \nunder inspiration and expected a church to be set in order where the Holy Spirit could be working with the gifts \nof  the  Spirit and  other  things  like  that.  So, we  are  blessed  that  we  could  be  an  example  to  others  around  the \nworld.  So, we are grateful.  Don’t take it for granted.  The Spirit of the Lord that moves here and the anointing \nand  the  preached  Word and  the  people who come  here, we must  not  take  them for  granted.  This  is  not \neverywhere.   \n \nAlright.  It was not just some rules and regulation. It is the Spirit of the Lord that anoints the people. The \nSpirit of the Lord comes and holds you there under inspiration.  Oh yes!  I was just thinking, while walking up \nto the pulpit and I could feel the presence of that ministering angel and  I  know when the congregation feels it \nand then I thought, but this is no credit to me because everyone of  you has a ministering angel.  Yes, they are \nsent unto the elect. Hebrews 1.  Yes, and then those spirits that the Lord sent, He maketh His angels spirits and \nHis ministers a flame of fire. \n \n \nHebrews 1:7 <And  of  the  angels  he  saith,  Who  maketh  his  angels  spirits,  and  his  ministers  a  flame  of \nfire.> \n \n \nThen  those  ministering  spirits recognize  this  ministering  spirit  and  holds your  attention, yes, and  give \nyou  expectation  and  inspire  you  and  quicken  you  in some  way  of  emotion  when  the  Spirit  of  the Lord moves \naround the church.  And we have one Spirit that is supreme above all.  Yes.  So we do not worship angels.  No.  \nBrother Paul talked about that: worship of angels.  \n \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   3 \n \nColossians  2:18 <Let  no  man  beguile  you  of  your  reward  in  a  voluntary  humility  and  worshipping  of \nangels, intruding into those things which he hath not seen, vainly puffed up by his fleshly mind,> \n \n \nWe don’t worship angels.  We worship the Lord.  So, I thank God for His ministering spirit.  Every elect \nhere ought to have a ministering spirit. \n \nYes, and the people’s hearts are so glad and they want to listen to this little message here tonight.  Some \nwent away and they are endeavoring to get the streaming somehow, and  I am sure that they are listening.  So, \nwe welcome you to the service. Yes, brethren who are away, we welcome you to the service.  We welcome our \nbrethren  from  overseas.  Oh  my! So  many  letters,  so  many  apps  coming  in.    From  the  time  I am finished \npreaching,  the  little  teenagers,  brothers,  sisters,  ministers,  one  after  the other, “Brother  Bruce, that  was  an \ninspiring message. We cannot wait until Wednesday. Yes, I thank God for those overseas.  Thank God for the \nchurches in the Caribbean and pastor McGahee over there, India and Africa listening in today.  And I trust that I \ncould  say  something  that  could  be  of  benefit, to draw  us  closer  to  Christ.  That is  the  effort  of  every  true \npreacher.  Not to come and show themselves. But to speak to the congregation to see what they can do today to \ndraw  them  closer  to  Christ,  draw  them  closer  to  the  token,  draw  them  closer  to  the  rapture.  And  any  other \nmotive other than that is just in the natural.  Yes.  So we want to see by these things how we can draw closer to \nthe Lord. \n \nNow, this  scripture  here  in Revelation 3,  that is  the  message  to  the  Laodicean  church.  And  the \nmessenger who was sent unto us was the man called Elijah, in the spirit, Malachi 4 and his name on earth here \nwas  William  Branham.  That  was  our  messenger.    Yes.    And they hated  that  man with  bitter  hatred  and  they \nhate him even now and hate the people who uphold this message. But we love that man because we love God \nand  it  was  God  Who  sent  him.  Yes, God  sent  him  and  we  received  this  messenger  who  brought  us  from \ndarkness  to  light, as  brother  Timmy Lambert preached  the  other  afternoon  and  he  will  be  preaching  to  us, I \nbelieve, for a few more days and he intends to give his testimony.  How many would like to hear his testimony?  \n[Congregation  lifts  their  hands  and  say,  “Amen!”] Well, you  are  committed, my  brother.  So, you might  be \nhere until month end.  So, we are thankful to the Lord.  I believe his testimony will be of great inspiration.  Yes, \nmy Lord. Yes, my beloved. \n \n \n \n\n[p2]\n\nLAODICEAN SPIRIT IS A WICKED, CUNNING SPIRIT \n \nWhy I read this scripture is to first make the statement to let you know, as the Christian church, the elect \nof God, those who have heard the Word of God and have recognized the Word of God and are acting upon the \nWord of God, I read that to show you what you are up against.  Every one of us are up against a wicked spirit \nof Laodicea.  It is a powerful spirit and most powerful, cunning, shrewd, smart, yes, and it is a spirit that could \ntake you to hell, if your name is not on the Lamb’s book of life.  The intention of that spirit is to destroy man, \nwomen,  children,  pastor,  deacon,  song  leader, destroy  everybody who he  can, and  he  does  not  grow  weary  in \ntrying.  Yes.   It  creeps upon people in such  a shrewd way. Yes, before  you know it  you stop doing the things \nthat you used to do, in contribution to your soul.  He has a way of coming and stealing you away from prayer, \nfrom the anointing, from attending services, from reading your Bible, from praying, from singing, and pull you \naway from the Spirit of the Lord, out into the natural things. \n \n \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   4 \nJohn 10:10 <The thief cometh not, but for to steal, and to kill, and to destroy: I am come that they might \nhave life, and that they might have it more abundantly.> \n \n \n \n\n[p3]\n\nPRAY, CALM DOWN, DRAW CLOSER TO GOD \n \nYes, it is an age where everybody is busy.  Everybody is in that rat race.  Yes.  God wants us to be quiet.  \nHe  want  us  to  be dedicated  to  him.    He  wants  us  to  be  set  aside  for  His  service and  He  wants us  to  use  this \nworld as not abusing it, as Brother Paul said.  \n \n \nI Corinthians 7:29-31 <But this I say, brethren, the time is short: it remaineth, that both they that have \nwives be as though they had none;  \nAnd they that weep, as though they wept not; and they that rejoice, as though they rejoiced not; and they \nthat buy, as though they possessed not;  \nAnd they that use this world, as not abusing it: for the fashion of this world passeth away.> \n \n \nAnd as Jesus said, “Sufficient unto the day is the evil thereof.” Yes, just enough to survive and give your \nall to the Lord.  We cannot get busy after this world’s goods, after the pleasures, after the things of this world.  \nThough  we  use  them, we must be careful that we don’t abuse them.  Otherwise, it  becomes  an abuse  to  our \nsouls.  Yes.  This is the reason that I read that scripture to show you that we are up against a terrible spirit that \ncould  bring  you  down  into  a  lukewarm  state,  though you  were  fire bright  when  you  first  heard  the  Word.  It \ncreeps upon you and makes you halfhearted and to give God a halfhearted service and it makes you lukewarm.  \nThat is what the Spirit of the Lord said. He said “I wert that thou wert cold or hot.” \n \nNow, this is God’s demand.  He don’t want you to be hot and cold.  He says, “I rather that you are hot or \nyou are completely cold.” When you are completely cold then  you will serve the world.  He says, if you get a \nlittle cold and a little hot, you are lukewarm.  And He says, “Because thou art neither hot nor cold, I will spue \nthee out of My mouth.”  Now, brethren, this is a terrible thing. The  Lord  demands desperation, and that is the \nspirit that is prevalent around the world and it has swallowed up all the churches in the world.  It  has crept in \namongst  the  followers  of  Malachi  4  and  made  them neither  hot  nor  cold.  It  has  placed  them  behind  ten-inch \nthick bars, yes, and he is after the church that is on fire with the revelation, the Word of God and he is out to get \nthe individuals because he cannot get the whole church. \n \nHe wants the individual and he will work with the individual, and you must be careful as the individual \nthat after you hear the Word of God and you receive a blessing and you go on fire and you rejoice in the Lord \nand you testify and you say, “It is the greatest message”, be very careful that the enemy does not come and take \nthat inspiration from you, as the days go by, as the weeks go by, as the months go by. You have to be on your \nguard.  Every day you have to be on guard.  Every day you have to pray and you have to pray more than once a \nday. And accordion to the condition that you are in, you might have to pray for hours.  And the least a Christian \nshould pray is one hour. That is the demand of the Lord. \n \nHe told the disciples: \n \n \nMatthew 26:40 <And he cometh unto the disciples, and findeth them asleep, and saith unto Peter, What, \ncould ye not watch with me one hour?> \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   5 \n \n \nBut a  Laodicean spirit came upon them and put them to sleep.  A Laodicean spirit was upon them and \nthey were not ready for the temptation.  They fled naked and they denied the Lord.  We have to watch out every \nday.  Brethren, if you don’t pray every day  and  you  let  a  couple  days  pass  with  that,  you will  be surprised  to \nknow how ungodly  you  get.  You will be surprised to know how worldly  you start to think and how  you start \naccepting  the  thoughts  of  the  old  man  and  the  devil.  You  must  pray  every  day.  You  must  pray.    That is  the \nonly way that you will be able to face the temptation. And Jesus said, “Pray that ye enter not into temptation”. \n \n \n \n\n[p4]\n\nNOT ENOUGH REVELATION, GET DESPERATE \n \nThe  greatest  temptation in  this  world  here  now  is  Sodom  and  Gomorrah, and  the  key  to  that  is  pray \nthat ye enter not into temptation.  Yes, that was just a little reminder of what you are up against.  We must never \ncome  to  the place  where  we  hear  such  great  messages and  rejoice  in  them  for  a  little  season  and  then  we  are \nback in the same old Laodicean rot.  That displeases the Lord. \n \nHe says, “My  expectation from  you is that you either be hot or cold.  I rather that  you  get backslidden \nand go out. Choose what you want.”  He said, “I rather that you were hot or cold.”  My demand to you is that \nyou get desperate.  When  you hear the Word of God, get desperate.  Get desperate to pray, desperate to read \nyour Bible, desperate to listen to the messages, desperate to let your mind go over to the things that stirred you.  \nDon’t forget them.  Be not forgetful hearers. That is what the Bible said. \n \nAs  you  meditate  upon the  things  that  you  hear,  revelation  comes within  your  heart.  We don’t have \nenough revelation.  You may think we have enough revelation.  If we had enough revelation, the rapture will \ngo,  the  token  will  be  here.  Yes.    We don’t have enough.  Brother  Bruce don’t have enough revelation.  I  am \nasking God for wisdom and He promised to give it and I have no doubt that He will give it.  Yes.  He said to ask \nand  He will  give, and don’t ask in doubt.  Just  ask,  turn  your  back  and  be  confident  that  He  will  give  you \nunderstanding. If you don’t have understanding today, beloved, cry to God for understanding.  When you went \nout and sinned, you committed adultery, fornication, lived nasty, went out there, you are lacking understanding.  \nIt is understanding that you need.  Pray the Lord that He gives you understanding.  Yes.   \n \nNow, I said this and I will say it again: one of the wrong things that the brethren could do, saints could \ndo, elect could do, is hear a great series of messages, rejoice in it and then start looking for what is coming next \nand forget what they heard there, and they heard it, they recognized it but they forgot to act upon it.  Yes, they \nforgot to act upon it. \n \nBrethren, when  we  hear  those  messages  like “Prophecies”,  when  you  hear “Proving Revelation 10:1”, \nwhen  you  hear the  message  and  the  revelation  of “Separation”,  brethren, that fire  should  burn  until  the \nrapture.  Here is God telling us what happened in the past, what is happening today  and what will happen in \nthe future.  Now, that should not depart from us. \n \nYour busyness  could  take  it  away  from  you.  Your  worldliness  could  take  it  away  from  you.  Your \ntelephone  could  take  it  away  from  you.  Your  internet  service  could  take  it  away  from  you.    Something  is  the \nstumblingblock in the way then.  There is some blockage.  If that is happening to you, there is some blockage in \nthe way.  Yes.  We have to find the blockage that is causing us to forget what we heard just a few months ago.  \nWe should still be rejoicing in those prophecies, and we have people here who are rejoicing.  We have people \nwho meditate upon it, yes, who meditate in the Word of God, Psalm 1. That is God’s order for us, mediate on \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   6 \nhis word day and night and then you shall be like a tree planted by the rivers of water which shall bring forth his \nfruit in his season, whose leaves shall not wither and whatsoever he doeth shall prosper. \n \nThis is a time, brethren, where you must become absorbed in the Word of God and the revelation.  Yes!  \nPeople get obsessed with the internet, obsessed with their phone, obsessed with a woman of the world, obsessed \nwith a man, but  they don’t get obsessed with the Word.  And  that  is  what  the  Lord is looking  for.  The  Lord \nwants us to become one with the Word. We must become obsessed with the Word, in such a way that it is our \neating, it is our drinking, it is our sleeping, it is our going out and our coming in. The Word of God revolving \nin our minds. \n \nYou  say, “Could that  really  happen,  Brother Bruce? Could  that  really  happen?”  There  are  people  like \nthat on earth.  Yes, my beloved, just like Psalm 1, just like Psalm 23.  That was a man who was obsessed with \nthe Word, obsessed with his God, meditating day and night. Yes.  They do not want to hear anything. A person \ncomes talking the natural, you want to cut that short.  Yes.  You feel bothered when people take you out of that \nframe  of  mind.  That  is  what  the  Lord  expects  from  every  one  of  us  and  you  must  get  like  that  to  stand  up \nagainst  this  Laodicean  spirit.  Look  at it  in your Bible.    He  said you have to  be  hot.  He  does not even  want  a \nhalfway  hot  and  halfway  cold.  He said, “Because  you  are  halfway  hot,  halfway  cold,  halfway  desperate  and \nhalfway lazy in the Word of God,  I will spit  you out of My mouth.”  That is a  great demand!  That is a  great \ndemand, a frightening demand!  Yes. \n \nBrethren, church membership is not going to work. “Well, I come to church because my parents come.  I \ncome because I belong to the church for a long time.”  That is not going to work.  You must have more than that \nto  fight  this  Laodicean  spirit.  Alright.    Not  intending  to  rebuke  you  tonight, but  because  of  that  spirit  of  a \nchurch member, half cold, half hot is why people will go through the tribulation, and what they could not purge \nhere under the preaching of the Word and the presence and the anointing, they will have to purge it out. Yes. If \nthey would enter Life, though they are children of God, they will have to purge that thing out in the tribulation \nto come up in the second resurrection.  We don’t want that.  We want our purging by the blood of Christ here.  \nWe have heard the Word, we have recognized the Word and we are acting upon the Word of God.  I speak the \nsame  for  Africa,  speak  the  same  for  India,  speak  the  same  for the Caribbean, North  and  South America.  My \nbrother, they are men  and  women  like Stonewall Jackson.  Yes, they  are  there.  They  believe  this  Word.  They \ncontend  for  the  Word  of  God.  They  strive  with  all  their  hearts.    If  they  fall, they  rise  again, not  doubting  this \npromise of God.  Alright. \n \n \n \n\n[p5]\n\nWHAT IMPACT THE WORD HAD UPON YOU \n \nNow, I am still asking, what impact the Word of God had upon you as a Christian, as a believer here in \nBethel, as a believer in GCC, as a believer in India, Africa?  You heard all those tapes, EODH messages, by the \nbundles.  You dances, you sang, you rejoiced, you praised, you gave honor to God’s servants.  What impact did \nit have upon you as an individual in India, individual in Africa, individual in GCC, in the Caribbean Islands and \nright here today, what impact the Word had upon you?  You are the judge.  If we judge ourselves, we shall not \nbe judged.  You are the judge.  You have to come up with the answer and when you come up with the answer, I \nwill give you the solution.  That is my purpose, it is to try to help you as an individual. We are not going in the \nrapture as a church.  We are going in the rapture as individuals. \n \nThere are three kinds of believers in the church, and one shall be taken and the other left behind. Two in \nthe bed, two grinding at the mill, two in the field and one shall be taken and the other left behind.  Yes.  What \nimpact?  Tell me. I am talking to you that you could examine yourself.  Examine yourself, see whether you are \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   7 \nin the  faith.  Now,  what  does  the  Word  mean  to  you?  You  hear  everybody  say that it is  great.  What  does  it \nmean to you?  You are not answering for your wife, now.  What does it mean to you?  You are not answering \nfor your husband.  Father, you are not answering for your children.  What does it mean to you as an individual, \nteenager  or  under  the  teenage  years, as  a  young  man,  a  young  woman, as  a  man,  as  a  woman  with  a family? \nWhat does it mean to you?  That is what I am asking about the impact of it. \n \nI don’t mean to say that you would dance and skip around the church.  I  am  talking  about  a  silent \nresponse.  Is it the greatest that you have ever heard?  Is it your all?  Is it Life to you?  Is it the greatest pearl to \nyou, more  than  anything  else  in  this  world,  you  want  the  Word  and  eternal  Life, and  that  is  sincerely not \nbecause your neighbor said that. You the individual, what does it mean to you?  What impact did the words of \nprophecy had upon you?  Did it put you in fear for a little bit and then you forgot it? You have not done well!  \nSeparation, did you put it into action against your father, against your mother, against your own children, your \nflesh and blood, or did you brush it aside?  Then something is not right somewhere. \n \nNow, if  you  choose  eternal  Life, beloved, above  everything,  every  other  thing  plays second fiddle. \nEverything plays second fiddle.  I am talking about sincerely  from  your  heart.  If all come  against it,  you will \nstand for it.  If all become forgetful hearers and walk away, beloved, you know that you will stand because there \nis a determination that is created in your heart.  \n \nI remember the different letters that the different ones wrote, as I preach.  Yes, lovely little sister in India \nafter  hearing  that  Sunday  message.  Oh  she  said that “There are  not words  to  tell  you  my  happiness  and \ngladness.  If I don’t get married in this life, I want eternal life, shepherd.”  Yes,  young lady!  Prime of life! “I \ndon’t care what happens in  this  life, if I don’t even get married, I want eternal life above everything.” And  I \nknow  that  there are  testimonies  in  the  heart  of  my  beloved  sisters  here  whose  hearts  are  made  up  that  way, \nlocally here and abroad.  Now, that is the impact it should create.  That is the impact that the Lord is looking \nout for.  Yes, my beloved. \n \n \n \n\n[p6]\n\nDETERMINATION \n \nNow, when  you  have  such  an  impact  and  it is  real  and  you  have heard  the  Word  of God, you  will  be \ndetermined to fulfill God’s Word and act upon it.  The deacon would not have to push  you.  No, no, no.  The \nminister would not have to push you. But that desire and that determination and that love for Life are going to \nbe the motivating factors.  I wonder what encouragement the Ethiopian eunuch had.  He got baptized down in \nIsrael and he alone went away.  What was motivating him?  How many souls did he win?  Did he win the soul \nof Queen Candace?  Eternity will tell.  Did he go back there and win his tribal people? Was he martyred for that \ngospel?  Eternity will unfold.  But the man humbled his heart and he was determined.  From the time he heard \nthe gospel, he humbled.  That is humility.  Preacher, that is humility.  Treasurer, that is humility.  Politician, that \nis humility.  Prime minister, that is humility. \n \nHe  was  a  treasurer  of Queen Candace  in  Ethiopia  and  an  angel  brought  the  messenger.  Yes, God  sent \nhim.  And the messenger asked the treasurer, “Understandest thou what thou readest?”  Imagine  that  you are \nasking a treasurer of a great state, “Understandest thou what thou readest?  And hear the humility of that man, \nthe honesty.  He said, “How can I understand save I have some man to guide me?”  Isn’t that a perfect answer?  \n“How can I understand save I have some man to guide me?”  He was not a puffed headed fellow who says to \nmind your business, “I just came from the Jewish temple as a proselyte and I have my priest to teach me. And I \nwas amongst the great priests and the high priest, and mind your own business.”  No, he had a hearing ear.  He \nwas born with it.  He was born with a hearing ear and when that hearing ear recognizes the voice of authority, \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   8 \nit responds.  Yes, “And he said, How can I, except some man should guide me? And he desired Philip that he \nwould come up and sit with him.” He jumped up in Queen Candace’s chariot. \n \nThe  gospel  could  take  you  to  certain  places  you  never  dreamt  about  and  make  you  talk  to  people who \nyou never had known.  Yes.  He said, “Come up and talk.”  And the place that he opened up the scripture to, \nright  there  the  mighty evangelist started.   “And  the  eunuch  answered  Philip,  and  said,  I  pray  thee,  of  whom \nspeaketh the prophet this? of himself, or of some other man?” And he started to preach Christ unto him.  The \nman heard because he had a hearing ear.  He had an understanding heart.  He humbled himself like a child to \nunderstand, and  when  he  came  to  the  end  he  was  convinced  that  the  messiah  had  come.  And  look  at  the \ndesperation.  He said, “See, here is water; what  doth hinder me to be baptized?” Not another minute must be \nwasted.    Yes.  “See,  here  is  water;  what  doth  hinder  me  to  be  baptized?” And  then  Philip  said, “If  thou \nbelievest with all thine heart, thou mayest.” (Acts 8:27-39.) He baptized him in the Name of Jesus Christ and he \nwent back to Ethiopia as an individual to a heathen nation.  What a light that man must have been in Ethiopia.  \nYes. Now, brethren, it is a reflection of a hearing ear and an understanding heart.   \n \nPeople  who  have hearing  ears and  understanding  hearts could  be  mixed  up in  such  that  it  seems  like \nthere  is  no  hope  for  them.  Now, maybe  you  missed  that.  Right  in  there  is  telling  me, out  of  all  the \ncondemnation of Laodicea: wretched, miserable, blind, naked, do you know people with hearing ears were tied \nup  in  that?  And we  are  some  of  those  people  who were  tied  up  in  that, and  God  had  loved  us  before  the \nfoundation of the world but we were eating down in Laodicea, living a Laodicean life. But hear the end of the \nstory.  The Lord said, “As many as I love I rebuke and chasten, be zealous therefore and repent”.  Who was He \ntalking to?  He was talking to those who hath an ear.  Read it.  “He that hath an ear, let him hear what the Spirit \nsaith unto the churches”.  And He was speaking to those people with a hearing ear, elected.  Hear what He said, \n“As  many  as  I  love.” That  was  before  the  foundation  of  the  world,  He  loved  these  people  because  they  had  a \nhearing ear and they were members of the Bride.  Alright. \n \n \n \n\n[p7]\n\nMOVE WITH EVERY SURGE OF THE SPIRIT \n \nHe  said, “As  many  as  I  love, I  rebuke  and  chasten,  be  zealous  therefore  and  repent”.  So, beloved, I \nbelieve that legion was elected too and he had a hearing ear.  How many people can we point out, preachers?  \nYou  are  not  yet finished  with  preaching  the  Bible.  Yes, many  people  had hearing  ears and  they  were  in  the \nworst condition.  These people came out of Laodicea, and what I am about to say is that you may be elected and \nwallowing in the things that you don’t supposed to wallow in, after being baptized as brethren, as Christians, as \nsisters, yes, and the Lord, He has a way of moving people because He loves them. \n \nYou might have slouched down in that Laodicean state and maybe you have that lazy spirit on you and \nyou  love  the  things  of  Sodom  and  Gomorrah, but  God  has  a  way  to  push  you.  God  has  a  way  to  move  you.  \nAnd  hear  what  He  said:  “As  many  as  I  love, I  rebuke  and  chasten  them.” I  rebuke  them  and  I  chasten  them.  \nNow, if  you  have  slouched  down  in  a  cold  and  a  formal  way  and  you  love  this Word  and  God  loves  you, \nbeloved, He is going to deal with you.  He is going to rebuke you in His sore displeasure.  He is going to move \nyou.  \n \nWhy wait until He moves you, is my point?  Why wait until God moves you?  I don’t want God to move \nme, brother. I want to move.  Move with the Spirit and move with the surge of the Spirit.  Now, every surge of \nthe Spirit that God sends, in way of His word: prophecy, separation, evaluation of the soul, all those messages \nwere surges of the Spirit.  Yes. \n \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   9 \nNow, the Lord expects that every surge of the Spirit that comes, He wants us to move with it.  We move \nwith the Lord as the pillar of fire moves.  When you hear that trumpet sound, the Word, it is time to break your \ntent  from  Laodicea  where  you  have  stationed  and  get  ready  to  move, whether  it is 4 o’clock, 5 o’clock, 10 \no’clock, midnight, you hear that trumpet sound, break your tent.  You have to move.  If you remain back there \nand say that you are sleepy, beloved, it is another station. Moses was going to stop at another station, according \nto God's  Word and  you  would still  be  breaking  your  tent  there.  Yes.    We don’t want that.  God  expects  that \nwhen  we  hear  the  Word  of  God,  you  move  with  the  pillar  of  fire,  you  move  with  the  Word  of  God.  Yes,  you \ndon’t look back, you don’t fuss, you don’t forget the things that you heard last month, last three months and say, \n“Well, those were good messages.” \n \nA  bad  mistake  that  people  could  be  making  is  that  they  want  to  know  when  Brother  Bruce  is  coming \nagain and “I wonder what he is going to have.”  Go and eat what you had for all the years.  Examine your life, \ncorrect  your  life and  become desperate  by  seeing  the  need  in  your  life  and  the  time  in  which  we  are  living.  \nPeople think nothing is happening.  You are going to wake up too late.  Brother, we are nearer than we think.  \nAll kinds of things are shaping up for this one world government and one world church.  Yes.  Your own money \nyou  cannot  get  it  in  the  bank. If  you  have  some  US  dollar  in  the  bank, you  go  down  there  right  now  and  ask \nthem  for  that.  They will tell  you to come  back  tomorrow.  Take  one  hundred  today.  And  that  is  your  money.  \nYou could have a million dollars in there, they will say, “Okay, we will facilitate you. We are going to give you \nten thousand.  Now, it is going to come that way with the local money one of these days. Watch out.  All these \nthings are speaking of the mark of the beast.  Yes, beloved.  So, we must move. \n \nWhen we examine our souls, we just don’t look down in there and say, “Well, yes, I know that  I  am a \nliar, and I dodge things when I am caught, and I try to win and leave that there.”  A lie represents a deceitful \nspirit.  You don’t trust a liar.  He is a terrible fellow.  Yes.  You don’t look down in there and say, “Well, yes, \nthat is true. I tell lies and I have the wisdom and I have the tongue to go around it without saying outright that “I \nlied.”  Now, that thing down in your soul is called deceit.  The heart of man is deceitful and desperately wicked, \nabove all things, He said. Jeremiah 17. \n \nNow, when  you  look  down  into  your  heart, you  must  be  able  to  act  upon it right  away.    Come  on. \nBrother Branham’s message - hearing, recognizing and you act upon it right away. The blockages in our souls is \nthat we know that there are certain things there that don’t belong there and we procrastinate.  We put it off for \ntomorrow. You  wait  for  a  magic.    We have  no  magic.  If  you will win,  you  must  fight.  Unto  them  that \novercome. You have to overcome that lying tongue.  You have to overcome all these things within your heart.  \n \nSo, as you examine the heart, I could only call it out. I don’t know what is in your heart, you see. It may \nbe anger down there that you never considered as something that could keep you away from the token.  Anger, \nwrath. \n \n  \nJames 1:20 <For the wrath of man worketh not the righteousness of God.> \n \n \nWrath,  anger,  uncontrolled  temper.  Do  you  know  that an uncontrolled temper  is madness?  I don’t \nknow how many understand that.  Uncontrolled temper is madness.  Here you get so angry, you are going to hit \na man.  You don’t care how hard you hit him.  You forget that he could die, and one man has to hold you and \nanother fellow has to hold you and then  you start hitting them too in order to fulfill  your desire.  You want to \ntell me that is sanity?  That is not sanity.  You hold down mad people.  The fellow went into a state of madness \nfor a little while there and then you hold him back. Afterward he is going to tell you, “Boy, if you did not hold \nme, I might have killed that man.”  He was mad for that certain time. \n \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   10 \nThe American people has the right phrase for that, when you see a man gets angry and can’t control his \ntemper.  They say, “He got mad at me.”  I agree with that.  Mad. That is madness.  Yes.  And people have those \nkinds of temper, wrathful display, and, beloved, they don’t work on it.  Now, if you don’t work on that now, \nGod  will  make  you  work  on  it.  Yes.    Let  me  see  how  mad  you are going  to  get  when  the  world  council  of \nchurches come down and the pope says to put you in prison and put you on the stretching wrack.  I want you to \nget mad at that time.  We better work it out here then.  Yes. \n \nYes,  a little  sister  gave  a  shout  of  victory.  I  was  dealing with  her  problem,  I  would say, for  years. \nHusband and wife cannot live together.  The last time they visited me, I looked at them and I saw that attitude, \nthat spirit. I felt so sorry.  I said, “The only thing that I could say is temporary separation in order to cool down \nthis  fight,  this  anger,  this  wrath, and everything  involved in  it.”  I said, “I  might  have  to  tell  them that a  little \ntemporary separation might help. Let the man know how to make out without a wife.”  Yes.  That little sister \nheard the message on Sunday. She wrote, “Brother Bruce, I know what my problem is. And what is causing this \nproblem is my anger. It is my anger.” \n \nNow, you  see, the Word  of  God  must  help  you  to  identify  the  wrong  things  in  your  soul.  Be  honest \nabout it.  Don’t explain it away. Don’t argue with it.  Now, this is self-examination.  Yes.  I felt so good about \nit.  I said, “There is no need for any temporary separation.”  She realized that her part is that \"I have an anger.” \nYes, spoke nothing about her husband again, no complaint. “My problem that causes the problem is that I have \nan anger that I cannot control.”  I said, “You have the victory.”  Yes.  I did not want to tell her that but it came \nthrough her  genetics.  Yes, it  came  down  the  genetic  line.  And  when  something comes through  the  genetic \nlines, you have to fight very hard, harder than a normal person.  And I felt so good for the little sister: “Brother \nBruce, the problem in the house is my  anger.  It causes me to say things that  I should not say, do  things that  I \nshould not do.”  That is in another conversation and confession. \n \n \n \n\n[p8]\n\nA WIFE IS NOT A SERVANT \n \nBeloved, a blockage in your heart could be lust, that you want to fulfill that lust whether you break the \nWord or not.  Yes.  You have to remove that blockage. Remove the blockage. Act upon it, pray, fast, give your \nall to the Lord and surrender all to the Lord.  “Lord, Your will be done in my life.” Yes, my beloved.  Another \nblockage in your life could be what the Bible says that God would not honor your prayer. That is mistreatment \nof your wife.  I don’t have time with this.  \n \n \nI  Peter  3:7 <Likewise,  ye  husbands,  dwell  with  them  according  to  knowledge,  giving  honour  unto  the \nwife,  as  unto  the  weaker  vessel,  and  as  being  heirs  together  of  the  grace  of  life;  that  your  prayers  be  not \nhindered.. \n \nCertain  men consider  their wives as hired  servants in  their  homes  and  treat  them  like  that. God  is \nagainst  you  for  that.  You  did  not  marry  a  servant.    You  married a  wife, not  a  hired  servant that that woman \nmust be running from morning to night at  your command.  “Go do this. Do that. Do the next.” And when she \ncannot  do  it  fast  enough  she  gets a bawl  out.  That is a  great  blockage  in  your  soul.  That  wife  ought  to  be \ntreated like a lady, because she is  a lady.  God  made her a lady, and  you must not advantage God’s daughter.  \nShe would not be your wife in the new world.  You borrowed God’s daughter and he loaned you her while you \nare here on earth living under this covenant.  Yes, and you ought to treat her like God’s daughter or that could \nbe a blockage in your heart.  Yes, my brother. \n \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   11 \nWhat  about  worldly  music?  Are  you  still  listening  to  these  worldly  music  in  your  bed,  on  your \nearphone? It  is  driving  you  mad.    It  will  cause  you  to  hate  your  mother,  hate  your  father and  hate your  loved \nones, because  that  is  what  that  song  is  projecting.  It  will  bring a  murderous  spirit  on  you.    You  will  become \ndemon possessed.  Well, you heard that before.  Why do you still do it, as the individual, at the expense of your \nsoul and the expense of your sanity?  After a while they will have to put you in the mad house.  It will bring you \ninto depression.  \n \nEverything that goes in the rapture must believe what I preach, must believe this revelation.  The Word \nmust make an  impact  upon  your  life.  You  have to  hear  it, recognize  it  and  act  upon  the  Word  of  God.  Yes.  \nYou feel that is a big boast.  That is no big boast, my brother.  Brother Paul said, “The world shall be judged by \nmy gospel.”  This is truth and everything else is false.  Alright. \n \n \n \n\n[p9]\n\nDISOBEDIENT SPIRITS IDENTIFIED \n \nMy  brothers  and  sisters, the  things  that  we  do reflect  the  condition  of  our  soul.  You  may  not  think \nthat is anything much but what  you do  reflects the condition of your soul.  Yes.  I preach the Word of God. I \nsaid what  is  the  need  of  carrying  these  long  nails  on  your  hand?  Remember  me  preaching  all those  things?  \n[Congregation says, “Amen!”] People who sat here know that. \n \nWhat is the reason for carrying this rubber band on your hand everywhere? “Well, I just wear it for so.”  \nNo, no, there is something from the soul that is pushing that out. “You mean to say a rubber band that you will \nfuss for?”  I am not fussing about the rubber band.  I am fussing about what is pushing out the desire to wear \nthat rubber band.  What is causing you to want big bangles on your hand?  Why do the deacons have to talk to \nyou  about  your  clothing  every time? “It is  tight  up  here.    It is bundling  your  chest.  It is  going down  in  your \nbelly.”  Why is it that the deacons have to talk to you about that?  All these things are within your soul.  Yes, \nthey are blockages.  Something is causing you to want that rubber band there.  Yes.  You go and figure that out. \n \nAfter you hear the preaching of the Word  you want long nails?  You better don’t knead my flour with \nthat.  I tell  you that.  And if  you  are a baker, don’t bring any  bread prepared for  Brother  Bruce to eat neither.  \nWhat do you want that for?  You say, “It is just for so.”  It is not just for so.  There is something behind that.  \n“Brother  Bruce, a  rubber  band  you are talking  about? And  Brother Bruce, you are  talking  about little  nails? \nThey  are not  so  long.” No, something  is  pushing  out  that  from  the  soul.  And  I  will  tell  you  the  Word  for  it.  \n‘Worldliness.’ It is a wrong example for your children.  Yes.  You say, “Well, I clean them every day.”  You see \nhow people make excuses?  Now, what is it showing? A disobedience spirit.  It shows an own-way spirit, self-\nled. Check and see if you are not self led in many other things.  This rubber band here is showing a disobedient \nspirit, own-way spirit, self-led spirit, and I don’t say anything. I don’t quarrel with you for that.  That is helping \nme to see within your soul that you are disobedient. \n \nYou  heard  the  Word  say  that.  You  heard  the  Word  speak about  the  nails.   You  heard the  Word  speak \nabout  your  shoes.  You  heard  the  Word  of  God talk  about  separation. You are still  budding  up.  You  are \ncommunicating by phone, you are communicating with these devils by apps and sit down in the House of God \nlike if you have done nothing wrong, causing you to fellowship with homosexuals, love them up.  It shows the \ndeceit in your heart.  It shows what impact the Word had upon you. It had no impact upon you.  No, and some \nhad a little impact and they  forgot  all about it.  What about these things?  You say, “I  passed right in front of \nBrother Bruce with these nails and he did not say anything.”  No, I would not say anything.  The Word has to \nspeak to your heart.  They say, “I wore a black rubber band right in front of him and he said nothing. Like some \npeople  make excuses when  the  deacons correct  them.  They  say, “Brother Bruce  saw it  and  he  never  said \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   12 \nanything.  I  did  not  say anything  for  a  reason.  I  want  to  know how  obedient  you  are.  I  want  to  know  how \nrespectful you are.  If you had respect you would not come near me, having the knowing that I preached that.  \n \nYou don’t jump on everything, as a preacher.  Wait, let it manifest, and when  you see the rubber band \ndisappear and you see that fancy watch, big like a clock, when you see it disappear, the party is growing.  When \nyou see those big high comb hairstyles, for the weddings, that wants to touch the roof. Boy, people’s heart are in \nthe world.  They don’t know what to do with themselves on certain occasions. I see some of them. I say, “What \nhappened to your head?”, right in the wedding.  [Congregation laughs!]  No, I am serious. “What happened to \nyour head, sister?”  She said, “Nothing, Brother Bruce. I am patting it down.”  Because it is a wedding you have \nto put that up in the air, you have to put on an invisible lipstick, invisible powder and run if the rain is drizzling \nbecause it is going to wash it from your face? \n \nNow, what is in your heart?  You examine your soul. I cannot.  That is pushing out from your soul. It is \npushing  out.  It  is deceit down  in  there,  disobedience  down  in  there, deceit, love  of  the  world  covered up  in \nthere.  I cannot stay too long on that.  Alright. “Get off of that, Brother Bruce.” Yes, I am getting off.  Yes, it \nhurts, does it? “I want those nails.” Why do you want the rubber band? Why do you want the bangles? Why do \nyou  want  the  rock  and  roll  music?  It is deceit, hypocrisy in  your  heart  and  that is blocking  your  ear  from \nhearing.  Yes, that is what is happening.   \n \nWhy did you beat your wife? Why did you kick her with your foot?  Boy, listen to me, that wife could \nforgive you but I am expecting your foot to rot.  Yes, and I won’t feel sorry for you a bit.  You have the guts to \nkick your wife who is cooking your food and washing your clothes and taking care of your children? Is that the \nheart you  have?  Whoever did  that, beat her on  the  road  too?    For  what?  Because  she  did  not  do  her  duties \nproperly.  Yes. \n \nThis is a lovely brother. He repents when he does wrong and I love that brother.  Because your wife did \nnot hang up your pants in the correct way, that caused her to get a licking.  No.  You have a servant, man. You \nhave an African slave.  Yes.  Take the pants and pelt in through the door in the dark and waiting for the slave to \ngo  out  and  pick  it  up  and  come  back  and  fix  it  how  he  likes it.  Boy, you  married  a  slave.  You  have a  nice \nyoung woman. You are a nice young man. You have a tender wife. You forced her to go outside in the dark, is \nthe story.  The woman felt so frustrated, she was going to leave the house with everybody at night.  You walked \ndown the  road  and  want  to  get  your  wife  now.  You  went to  get  the  servant.  Your  servant  must  not  leave  the \nhouse.  I don’t know how much cuff she got and where she got them and  came  back  home.  Is  that  the  way?  \nBoy, I tell you, how can you treat a sister, a daughter of God like that?   \n \n \n \n\n[p10]\n\nBLESSINGS AND CURSES OF INTERNET \n \nI have come to the blessings and curses of the internet and the blockages in people’s soul here: locally, \nabroad, Africa,  India.  It is  hinged  right  here on  this  internet  and  electronic  devices.  I  sanction again  Brother \nPatrick’s message.    Give  that  a  number.  Put  it  right  next  to this  message.  Electronic  devices.  Now, that  is  an \ninvention  of  Satan,  all  these  devices.  That  is  science that stepped into  the  fourth  dimension  and  the  fifth \ndimension where Satan is and all the demons that control that upon the earth.  Check it out. \n \nDemons  from  the  fifth  dimension  control  what  they  took  out  of  the  fourth  dimension, in  way  of  radio, \ntelevision and all electronic devices. And let me put this in here.  It is from the tree of the knowledge of good \nand evil.  There is good in it.  The good is demonstrated right here.  I am speaking here and people are hearing \nme  overseas.  They  are  seeing  me  overseas.  Yes.  God  has  turned  it around, just  like  the  tape recorder, and \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   13 \neverybody hears the messenger’s voice. There is good in it, but there are blessings and there are curses that are \ninvolved in this, in the internet.  It is hooked up in the tree of the knowledge of good and evil.  \n \nJust  like  the  automobile is  a  good  invention.  We  want  it,  we  use  it, but  the  motor  vehicle, as  a  whole, \nkills more  people  around  the  world  than  in  a  time  of  war.  I  am  talking  about  motor vehicles.  They kill  more \npeople, every day, every year, than a war. Satan would not give you anything for nothing.  He has a plan.  Okay.  \n \n \n\n[p11]\n\nCARS KILL MORE IN A TIME OF PEACE \n \nQuote W.M.B.: 107-2 The Tree of Knowledge produced clever men; men of renown. But their ways are \nthe ways of death... \nThe seed of the serpent has brought tremendous commerce, wonderful inventions, but with it all comes \ndeath. Their gunpowder and atomic bombs kill in war; and in peace time their mechanical inventions, such as \nthe car, kill even more in a time of peace than do the inventions of war destroy in times of trouble. (Ephesian \nChurch Age  -  Church Age Book  Cpt. 3). \n \n \n \n\n[p12]\n\nTELEPHONES/CELL PHONES/INTERNET/WHATSAPP \n \nRight now I am using Satan’s invention, and we are thankful that much for science.  I could speak. They \ncan hear abroad. It is useful for humanity.  It is useful for the church.  Alright.  We need communication. Yes, \nwe  do.  I  am  using  it  now  to  communicate  to  India  and  Africa  and  through  the  world.  That  much  I  give  the \nLord glory for.  Alright.  But there are curses in this that you have to watch.  Okay.  The advancement of these \nthings, beloved, is very great.  I don’t know if they could get any greater.  It is great and I believe that they are \nimproving every day.  Every month they want to bring out a new phone with new features.  You have to pay so \nmuch more money.  Then that becomes old and they have a new one with one or two other features.  Now, this \nthing came up just recently. Yes.  This was not in the days of Brother Branham. Internet was not in the days of \nbrother Branham.   \n \nNow, people who want to stick to the letter: “Show me where Brother Branham condemned the internet.  \nSay only what the prophet said.”  Alright.  Now, the arguments cannot stand up.  Okay, brother.  It is one of the \ngreatest inventions, the most useful for mankind.  We use it at the church. The brethren use it.  Yes, it deals with \nscript, texts, writing.  Whereas I used to have to run down to Port of Spain and send a telegram to Brother Bob, \nBrother  George and  that  was  only  a  few  words, “Brother  Bruce is arriving on Thursday  coming.”  That  was \ntelegram, script. \n \nA  little while after, home  telephones  became  very  popular in homes.    Everybody  could  hear  what  you \nwere saying in the house.  Then a little while after came in the cell phone, no pictures, just your voice.  You had \nto have money to own one of them phone.  It was six TT dollars per minute. The telephone company declared \nthree hundred and fifty million dollars in profits in just a few months.   \n \nIf you wanted to see videos, you had to go down to the cinemas.  Alright.  Then later on they brought the \ntelevision into the home.  Brother  Branham kicked against that television  with all his might, and  what he said \nwas  that “We  preach  against the  cinemas, but  the  devil  brought the  cinema  into  the  houses”, and  he  was \nshowing  how it  will  pervert  the  people,  pervert  the  children.  Now, all  those  things  built up  until  we  have \ncorruption through the world: lesbians, homosexuals - whole nations.  Alright.  Those were the older inventions. \n \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   14 \nIf you wanted to see any movies you had to go and they had a big projector and used to show you that.  \nBrother, television came and replaced that until all the cinemas had to close down, in this country I am talking \nabout.  They  had  to  close  down.  Do  you  know  what  you are sitting  on  there?  The  cinema  chairs  we  bought.  \nYes, we purchased.  I went and sat right under the auctioneer-Brother Edward Soon. I did not want anybody to \ncompete with me. They bid so much and I said, “So much and so much.”  Somebody bid so much. I said, “So \nmuch and so much.” Yes.    One  fellow  bawled out  there. He said, “I have  to  be  a  preacher  too, boy. I  have  to \nbuild  a  church.  There  is a  fellow in  front  there buying out the chairs.” Not  bothering  them  at  all,  I  said, “So \nmuch and so much.” Yes. Brother  Edward Soon  dropped the  hammer, ‘Bam,  bam,  bam,  bam’, “Sold.”  Yes.  \nWell, we are sitting on them today.  Ask Brother Eddie Soon.  So, my brothers and sisters, it advanced.  Brother \nBranham kicked against that television. True believers did not want that in their houses. He said that he would \nblow it out with his shotgun.  He said that it is a hellevision, not a television.  Yes, he was against that. \n \n \n \n\n[p13]\n\nINTERNET, DEVICES GREATEST CURSE \n \nNow, the  internet  and  all  these devices  have  become  the  greatest  curse  to  the  world.  And  look  at  the \ntrick.    When  we  got  rid of  our  televisions, beloved, the  devil  in  a little  box, getting  smaller  and  smaller  every \nday,  he  put  the  radio  in  it.  He  put  the  video  in  it.  He  put  all  kinds  of  internet  connections  in  that.  Alright.  \nWhatsapp - you know that is a worldly word.  They use that in America. That is how the name came about.  A \nfriend meet another friend, he says, “What’s up?”  So, they put it in there and they call it “Whatsapp.”  So, that \nis an American slang. They say, “What’s up, boy?”   \n \nNow, in  this  little  thing  out  here is your  radio,  is  your  television,  is  your  movie. It is your  contact, \nlocal  and  foreign.    You  could  see  every nasty  thing  on  earth: homosexual  acts,  lesbian  acts,  any  immorality \nthat you think about right in that little box.  Now, whereas the television had to stand up in the house and you \nlooked at it, now Satan took everything and carried it into the bathroom.  You could go in the bathroom and see \neverything you want to.  On the whatsapp, a man used to watch his wife and say, “I don’t want you to go around \nby the neighbor. I don’t want any communication. Now, on whatsapp, she talks to another man, “Meet me at so \nand so place. I will be leaving home in five minutes.”  Oh yes!  They are going to have an act and they are so \nsmart, they delete all the evidence.  ‘It never happened.’  Oh yes! \n \nNow, beloved, this internet and all the devices have become a great trial to this world and the greatest \nsnare.  It is causing more adultery, more lesbianism acts, more homosexual acts. And I will tell you one of the \nmajor things that the devil has invented that for (I am talking about the world), and that is the greatest transport \nservice of immorality, nasty dressing, nakedness.  It has become a transport system.  Give me a little extra time \ntonight.   [Congregation  says, “Go  on,  brother!”]  Transport  system.  Yes.    The  devil  knowing  that  all  these \nperversions  will  take  place, that  whole  nations  will  be  homosexuals and  lesbians,  he  prepared  this  device  to \nteach the rest of the world how to live in immorality and to entice people on these immoral practices, just like \nhe  sent  through  the  television  nakedness  and  immoral  dressing  and  transported  them and  has that  through  the \nworld,  conquered  the  world,  sent  rock  and  roll  music  and  sent Elvis  Presley - that  child  of  the  devil.  Brother \nBranham called him a child of the devil, that way over in Africa, he went among the Hottentots and they were \nplaying  rock  and  roll  music  on  a  little  box.  Polluted  the  whole  world  with  the  television.  Polluted  the  whole \nworld with the radio.   \n \n \nQuote  W.M.B.: E-40 ... Do  you  realize  that  all  this  stuff  that's  going  on  today,  these  rock-and-roll \nparties that you're all are attending, up in them places, when they go so frantic and get in such a maneuver, the \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   15 \nPresley and them, till young ladies take their underneath clothes off and throw them up on the platform for him \nto autograph, and call that civilization, when they send dozens of them to the insane asylum afterward?  \n...Way  in  the  Hottentots  of  Africa,  that  same  mournful  sound...  When  I  seen  them  stand  there,  and  the \nwitch  doctors,  and  they'd  go,  and  them  sounds.  Heathens  with  paint  over  their  face,  and  the  young  women \nwould dance out there till they'd...?... sex parties and everything else. And America in it has reached the top of \ncivilization and swinging backwards and going into heathens again, painting and rocking, and-rolling thus, and \neven calling themselves church members. Amen. (56-1005 Painted Face Jezebel). \n \n \nThat  was  not  sufficient. Now, brothers  and  sisters, it  has  become  a  curse  to  the  whole  world  by \nspreading perverted acts, yes, how to perform them. Make them common like if it is normal. “It is normal like \na  normal  husband  and  wife.”  That is  the  drive  on  it, and  they  are  saying  that  men  have  now  found  their \noriginality when they declare themselves as homosexuals and lesbians. “It is original.” And they are exporting \nthat  through  the  world.  Now, brethren, that is  the  world.  They  are  on  their way  to  hell.  Yes.    All  want  that.  \nThey want homosexuality, they want lesbianism. And if they are not doing that, they are protecting those who \nare doing that.  So, what they are doing is that they are exporting Romans 1. Yes.   \n \n \nRomans  1:18-32 <...Wherefore  God  also  gave  them  up  to  uncleanness  through  the  lusts  of  their  own \nhearts, to dishonour their own bodies between themselves:  \n...For this cause God gave them up unto vile affections: for even their women did change the natural use \ninto that which is against nature:  \nlikewise  also  the  men,  leaving  the  natural  use  of  the  woman,  burned  in  their  lust  one  toward  another; \nmen  with  men  working  that  which  is  unseemly,  and  receiving  in  themselves  that  recompence  of  their  error \nwhich was meet.  \nAnd even as they did not like to retain God in their knowledge, God gave them over to a reprobate mind, \nto do those things which are not convenient;  \nBeing filled with all unrighteousness, fornication, wickedness, covetousness, maliciousness; full of envy, \nmurder, debate, deceit, malignity; whisperers,  \n...Who knowing the judgment of God, that they which commit such things are worthy of death, not only \ndo the same, but have pleasure in them that do them.>  \n \n \nWe are at the end you know, brethren. We are at the end.  When Sodom and Gomorrah reached to that \ncondition, God  burnt them.  Alright.    So  I  am  saying  that  Satan exported  all  those immoral things by  that \ninternet system, with more advancement. It is here to stay. \n \n \n \n\n[p14]\n\nPASTORS HANDS ARE TIED AGAINST INTERNET \n \nThe pastor cannot do anything about it.  Brother Branham preached against television. People got rid \nof the televisions.  We preach against it.  We don’t want them in our homes.  Do you know that now the devil \nbrought  in  all  those  electronic  devices  and  my hands  are  tied?  I  cannot  tell  you  to  get  rid  of  your  phone.  I \ncannot put any middle line to this to get a regular phone only and not an internet phone. Do you know that my \nhands are tied?  The pastors’ hands are tied.  Kenny McGahee’s hands are tied.  Micah’s hand is tied up there in \nUSA.  And do you know that in that little box there is a television, there are nude pictures, pornography? And \ndo you know that every little fellow is carrying around that in his pocket and the pastor is helpless?  And do you \nknow that parents  are  helpless?  Do  you  know  that  the  husband  is  helpless  and  the woman  is  helpless?  I  am \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   16 \ntelling you, it is a terrible thing.  How can I come and tell you now, children, to get rid of your internet phone?  \nNo.  You are already caught in the trap.  You could use it under your coverlet, teenagers, and some of you are.  \nYou could use it in the bathroom. Pretend you have a diarrhea.  You could lock your room tight, as a wife, as a \nhusband, and look at what you want there: love stories, all kinds of nastiness.  Husband knocking the door for \nfood and you cannot come out because you are too involved in the love story and in the pornography.  Oh yes!  \nThat is what is going on. \n \nSatan has succeeded in bringing  all those things in  your homes.  It is a television.  It is  a movie.  It is a \ntheatre.  It  is a cinema.  It is  a  radio.  And  it  comes  into  your  house  and you  have privacy.  You  have  all  the \nprivacy. And another thing is it is so swift that all that I have to say on the apps is “Yes or no. Put out that man \nor retain him”, and it is gone in a second: Africa, India, America.  It is a great and a useful tool, but the world \nwill have to pay a heavy price.  It will seal the doom of billions of people on the earth.  They cannot do without \ntheir  phones and  we  have  seen  the  example  with  some  who  were not  ordained  to  eternal  life.  Yes, people \nsnapping  their  naked  bodies,  sending  it  out  to  other  men  and  husband  cannot  stop  them.  Pastor  cannot  stop \nthem. Told one of the ministers, “I will not give up my phones.”  Where are they tonight?  They  are out there \nprostituting  themselves.  Not  only  that  but  bringing  it  to  the  public  on  Facebook, in  defiance  to  the  church,  in \ndefiance to the ministry.  They became possessed.  Alright, friends.  So that is the world, but I am talking about \nthe church now. \n \nSatan has  succeeded  in  bringing  it  through  the  plain  message.    What  is  the  condition  in  the  plain \nmessage?    Ten-inch  thick  bars.  He  has brought  it  into  homes.  Yes, it  has  become  a  tool  and  lots  of  it are \ninternet phones.  When I say “Internet”, you can get anything on the internet, good or bad, naked, homosexual, \nlesbian,  women  living  with dogs,  cats,  animals  and  a  child  is  able  to  see that  if  he  is  interested.  Now, these \nthings and that little unit is a destructive unit-destructive to the soul. \n \nChristian people under EODH, under the message, will hand their child one of those phones.  They say, \n“That is only for pictures (and it is working with the Wi-Fi at home), so they cannot do anything wrong because \nthey don’t have an independent package for two hundred or three hundred or five hundred dollars.” Yes.  Now, \nit has become a toy: one for the wife or three, one for the husband, one for the child and one for the baby.  I am \ntelling you. \n \nI have some little fellows. One of them could operate my phone.  Never  went to school one day in his \nlife and he punched in the security code-six numbers that I have and opened up that phone.  I said, “Let me see \nwhat that is.” Opened up the phone and was looking at pictures.  So, it is a camera. It is a telephone.  So, if I say \nthat I  am  taking  away  your  telephone, you would say, “Brother  Bruce,  what  kind of  thing  is  that?  You are \ntelling me that I  cannot  use a telephone?” It  used to  be that  a telephone was in  the  house  and  everybody  was \ngoing to hear.  If a child was going to call, you heard what he or she was saying.  Not so?  Yes, not now. \n \n \n \n\n[p15]\n\nPHONE – MULTIPURPOSE: SODOM BOX, GOSSIP BOX \n \nNow everybody has a phone.  My mother, now  90  years old, used a cell phone up to about a  year ago \nbefore she  got  sick.    Cell  phone!  Old,  young,  you  are  walking  with  your  temptation  in  your  pocket.  Young \nfellow, young girl, women, man, children, you are walking with a pocket of temptation and your father does not \nestimate it like that, mother does not see it like that.  They woke up late.  That is the box that they are using to \ncommunicate  with  homosexuals.    That is  the  little  box  they  are  using  to  communicate  with  backsliders-nasty, \nfilthy backsliders who I would not even spit upon, and giving them information from the church. \n \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   17 \nNow, it is useless to preach about gossip.  That is a gossip box.  I am telling you, it is a gossip box.  It is \na tale bearing box. It is a gossip box. It is an adultery box. It is a fornication box. It is a homosexual box. It is a \nlesbian  box.  It  is  a  stealing  box.  It  is a  cussing  box.  Have  you  estimated  the  damages and  have  you  seen  the \ndamages that such did to families right in Bethel, under the Word of God?  It is too disgraceful to describe those \nthings to you.  The nastiest things you could ever think about. \n \nYoung girls stripped themselves half naked, naked and sent it to unsaved men. Then lie like a dog until \nthey  were pinned down.  You  have  to  bring  unsaved  people  as  witnesses.  Wives  send  out  their  private  parts, \nadvertizing and those women went out now to do what they  were longing for: prostitution.  Now, that did not \nwakeup certain people. Let me speak.  Some turn on their phones and look at the nastiest things that they could \nlook at: oral, homo, lesbian, adultery. \n \nChristian men, now bringing that to their wives to practice that and call themselves Christians.  Where \ndid  you  get  that?  I was  looking  at  pornography.  Forcing  their wives  to  have oral.    You  stinking cobeaux \n(vulture) you.  You  are  a  nasty vulture.  The  very  thought  of  it makes me  feel  to  vomit.  You  are  a  nasty \ncreature.  Get  that  on  the  net  and  want  to  bring  it  home  to  the  wife  and  tell  them that it is  normal.  “That is \nnormal. The world is doing that and the doctor says it is healthy.” That is what the doctors are educating people \nabout.  They say that there is nothing wrong with that.  No. But the stinking doctor would not tell them that it \ngiving herpes from your mouths to the genitals.  They would not say that.  They themselves have herpes. Yes. \nThere is simple herpes in the mouth. That is okay. But when you go and crossbreed that by doing that nasty act, \nit makes genital herpes.  That is how herpes started.  AIDS start by homosexuals.  Yes.  Imagine with this law \nthat they passed now how much AIDS will be in the world.  It is a horrible thing.   \n \nNow, my  beloved, your  children, you  give  them  this  phone,  your  wife, you  give her this  phone.  Well, \nyou  have  great  confidence  in  them. “They  will  never  do  that.”  Children  are  inquisitive. I  said children  are \ninquisitive.    Your  wife  is  inquisitive and you don’t know if she has the  born  again  experience  to  handle  that.  \nMan, I don’t know  if  you  have  the  born  again  experience  to  handle  that.  You must  have  the  impact  of  the \nWord.  The Word must have such impact in your life that you could handle it like Bruce and you could handle it \nlike others in this church.  I use it for the glory of God.  I am online 15 hours a day.  I don’t mean to say that I \nam looking at it for 15 hours a day.  It is damaging to your eyes, number one.  Yes, I am online.  I am at duty to \nthe brothers around the world. \n \nBrothers and sisters, has the Word had such an impact upon you? Has the closeness of the time had such \nan  impact  upon  you?  That is  my  point.    Are  you  obsessed  with the  Word  of  God  that  you  would  not  watch \npornography on  your phone, that if  you are halfway impotent, you use that to stirrup yourself to come to  your \nwife?  Excuse the expression.  That is what they are using it for.  A lot of men are dead. I am telling you.  You \nsee  these chemical  foods and  all  these  things, young  fellows are impotent.    They  will never  admit  that.  And \nwhen  you  start  having  those  problems,  do you  know  what  happens?  You  start  to pervert  acts in  order  for \npleasure.  Yes, you don’t want to give up. \n \nMy philosophy is if you are dead you are dead.  If you are impotent, well, you have come to the end of \nyour life.  You don’t go looking for young women like a nasty old man here between 70 and 80. He went to a \nman's wife and told the man's wife, “I have an erection for you.”  You are a nasty fellow and you have a nasty \ntongue in your mouth.  You are a filthy hypocrite to come and watch your pastor in the face and lie.  Excuse the \nexpression. I am talking about what impact the Word had upon you, friend, after sitting and hearing prophecies, \nRevelation  10:1,  oh  my, separation,  the  dangers  of  these  things.  You  would walk  up  to  a  man’s wife  and  do \nthat, and  you  said, “The  man  is my  own  son  and  this  is  my  daughter-in-law?”  You  are  a  filthy  hypocrite, \nbrother.  You talk about a lying tongue. I don’t trust your shadow.   \n \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   18 \nBeloved, I am not cutting off this from the tape.  It will be going. The world has to know that there are \nthree kinds of believers here, in GCC and everywhere. Some are heading for hell and some are heading for the \ntribulation.  Hear,  recognize  and  act  upon  the  Word  of  God  in  order  to  go  in  the  rapture.  My  Lord! Satan \nbrought it home to the child, I am telling  you.  The little baby is fighting for the phone. They want to see and \nparents are giving them it from a babies, without supervision.  There is a way to handle that.  You want to show \nthem  a  little  picture  or  something.  Okay, you don’t make them obsessed with  a  phone  and  with movies.  Oh, \nyes! \n \n \n \n\n[p16]\n\nINTERNET – A GREAT TRIAL TO THE CHURCH \n \nNow, let  me  tell  you  something, in  closing. God  allowed these  devices  and  this  internet  to  try  the \nchurch.  There is nothing, there is not any law, there is not any policy that I could set.  Brother Branham could \nhave preached against the television and said he would have blown it out with a shotgun.  There is nothing that I \ncould do.  Do  you know what I have to do?  Leave it to  your sincerity. Leave it to  your trial. Leave it to  your \ntesting.  It will show up who you are.  It is going to show if you heard the Word of God, if you recognized the \nWord of God, and if you are acting upon the Word of God. \n \nYou want to handle  your  young  children? What are they doing  with that  phone? And they  can work it \nbetter than Brother Bruce, better than the mother and better than the father.  What are they doing with that under \nthe  coverlet?  What  are  they  doing  with  that  in  the  toilet?  Don’t you know children are inquisitive and don’t \nyou know that when they start doing that and they get so interested in those things in there, don’t you know that \nthey  will  dry up  right  in  your  house  and  the  Word  will  have  little  or  no  impact  upon  them  because  they  have \nthose blockages in their souls?  You get a  young person to see pornography one time and there is no place for \nthe Word.  It revolves and revolves. Sex revolving. Yes.  Oh my! I can’t describe it as I want to and it is going \naround and you trust them. You say, “They will never do that.” \n \nOne man told me, he said, “I gave my children a phone like that, but Brother Bruce, when are they going \nto sleep all phones are out on the table.” I compliment the man for that.  I said, “I could understand that.”  I said, \n“What about when they are resting during the day or so?” He said, “No, I don’t take it at that time.” That is your \nloophole.  I said, “What about when they are going to the toilet?  Can they use it in there?”  I am not charging \nthe  children  for  anything.  You have  confidence  in  your  children  but  if  they  are  not  born  again, they  will  be \ntempted.  If they are not anointed and if you don’t see them interested in the Word of God and they are restless \nwhen they hear that Word of God and they want to know more and that thing is going to take them away from \nlistening to a tape.  Alright, I am coming to that. \n \nGod  sent  this  as  a  trial.  He  could  have  stopped it.  And  I  cannot  stop  it.   I  could  only  give  you \nguidelines and I could leave that to your sincerity and honesty in misusing this phone and misusing the internet.   \n \nNow, some  get  so  carried  away, but, beloved, that  internet,  just  like  Brother  Patrick  said,  has replaced \nprayer.  It has replaced reading the Bible, replaced their prayer lives and their little devotion with the children.  \nInstead of that, they get the children, put on a movie and say that they are looking at documentaries.  No place \nfor  prayer.  Every day they don’t see him  praying, they don’t see him reading the Bible, they don’t see him \ndoing this nor that. The children follow him.  That is the same nasty fellow will now introduce oral to his wife.  \nTell me if that is correct? Brother, is that the impact the Word had on  you, man? I am not rebuking. I am still \nasking, “What impact the Word had upon you?”  Yes. \n \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   19 \nIf you really heard, you ought to recognize and you have to act upon the Word.  This is pulling you out \nof the tribulation, friend.  This is pulling you, my beloved, back to your senses.  This is getting you ready to get \nthe token.  I don’t delight in rebuking. I don’t delight in exposition, my beloved. But I delight in your salvation.  \nI want you to be saved.  These things will come up at the time of the token.  I am telling you, these things will \ncome up at the time of the token and God will remind you. Yes, God will remind you.  \n \nIs your daughter, your son sincere enough not to interfere with the wrong things on your internet phone?  \nYou trust their sincerity. I agree with that.  You will give an account for their salvation.  If you over trust them \nand  you  cause  them  to  do  the  wrong  thing  and  you  let  them dry  up  on  the  church  seats-cannot  sing,  cannot \nworship, cannot understand, cannot rejoice in the messages, you will give an account, not me.  That is the line \nthat I will draw.  It is beyond the pastor’s control now, whereas the television was in the pastor’s control. It is \nbeyond church policies.  There is no policy here to tell you that you cannot have a phone.  No.  I will not take \nup that job.  I will not take up the job to find out if  you have an internet phone or an ordinary phone.  It is to \nyour own judgment, to your own loss of your children, own loss of your wife. \n \nHere is your wife. You trust her so much, you give her an internet phone.  She went and bought a second \none  and  maybe  a  third  one  and you  found  out  what  she  was  doing.  She said, “I  will  not  give  up  my  phone.” \nSending pictures all about. Told a brother when she passes to touch her butt.  “Christian”, drinking communion!  \nYou stinking whore! Wicked hypocrite! Nasty slut, saying you are a Christian.  You are going to hell.  Oh yes, \non the way to hell. A bunch of them left, divorced. Oh yes. \n \nNow, this is to show up what impact the Word had upon you.  I cannot stop this internet phone. I cannot \nstop  the  internet. I  cannot  even  stop  a cell  phone, but  yet  there  are  people who are living  above  that in  here. \nThey don’t even want to see one of that.  Compliments to you!  And if they even have one, they use it for the \nright purpose.  I know of young ladies who are afraid to have an internet phone, and I know that they are able to \nhandling it.  Wonderful sisters! “Brother Bruce, I am afraid of that. I would not have one.”  I know.  That is the \ntime that I could trust you.  Oh yes, brethren.   \n \nNow, it  has taken  away  the  prayer time,  the  fasting  time,  church  time, and  that  is  going  on  all  around \nwhere these phones are. \n \n \n \n\n[p17]\n\nINTERNET BEYOND MY CONTROL \n \nYes, Brother Kenny, you lick that spirit.  That is why the people are not praying. That is why they are \nnot listening to the tapes. That is why they are not doing the things that they are supposed to do, even because \nthey spend all their time on such worldly things.  They are obsessed with the phone and it is internet addiction. \nThat  is  what  is  happening.  It is internet  addiction.  You  have  hypocrites right  here  communicating  with  the \nungodly.  You have hypocrites sitting here watching pornography.  Yes.  It is going to damn your soul, young \nfellow, young lady. It will damn your souls.  It is beyond my control.  Now, I leave it up to your sincerity. \n \n“Brother Bruce, what will you do about it?” Nothing!  I am helpless.  I am depending on your sincerity.  \nYes. “Brother  Bruce  I  found my  daughter looking  at  pornography.  She was  involved  with a  boy  and  I  caught \nher  living  in  fornication.    She  stripped  herself  and  sent herself  naked.  Brother  Bruce, I  want  to  make  a \ncomplaint to  you.” Why did you  give  her  that  phone?  Why did you  put  that  phone in  her  hands?  I  advised \nsome of you to take that phone away from that young girl.  You put it back in her hand. And some parents, they \nhave movies going on, television or internet, whatever, and they call their little children to see the nasty things \nfrom what they are looking at, internet or television.  I am talking about rude things, nasty things.  You know \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   20 \nwhat  that father is  trying  to  do?  He  is  trying  to encourage  that  girl  and  bring a  spirit  upon  her  and  he  might \nwant to commit sex with her.  He is waking up her passionate fibers. Yes!  It is a nasty father who will do that. \nNasty, stinking people.  You will call that child, young child, young girl, teenager, whoever they are, to see sex \nacts going on?  They say that they are educating them.  Why are you educating that little girl now in the bloom \nof her youth?  You are trying to wake up her passionate fibers and you could have plans to live with her.  You \nare not born again. You have no Spirit. You are not anointed. You are a nasty man. And if you, the mother, are \nallowing  that, you  are  a  nasty  woman. “What  to  do  with  her?  I  found  her  with  this  phone, and she  is  doing \nwrong things?” No, that is your  problem,  not  mine.  It  is  testing  your  sincerity,  father’s sincerity,  children’s \nsincerity.  And  what  we  have  in  the  world  today  in  the  Christian  church  and  right  here  are people  who  are \nobsessed with the net-internet obsession, internet addiction, just as if you are smoking ganja. \n \nPeople cannot do without that phone. They have to pay plenty money for talking.  Your husband has a \nphone that is costing you several hundred dollars a months for the internet package. “Wherever you are, I must \nbe  able  to  talk.” Wherever  you  are, you must  be  able  to  gossip.  Wherever  you  are, you must  be  able  to  tell  a \ntale. Wherever you are, you must be able to be in contact. You are a gossiper. \n \nHusband  has a  phone,  wife  has a  phone,  internet phone.  Three  hundred  and  three  hundred, it is  six \nhundred, and  this  person  here  has  to  do  her  lesson.  It is  another  three  hundred.  Let  me  put  it  down  to  seven \nhundred dollars and you are using out that five hundred minutes in a month and you have to borrow.  Now, that \nis plenty talking. “And  you know girl, have you  heard about this so and so? You heard that they put out Such \nand  Such  from  the  church?” You  gossiper, you. You don’t have time  to  cook  your  husband’s food. “I  was  a \nlittle busy on the phone talking.” Why do you, husband and wife, want two internet phones?  Why do you want \nthat? \n \nOne man set an example. He said, “My wife and I will have one internet phone.  Everything that comes \ninto her, I must see it.” What secret do you have that  your husband cannot know?  You want your own phone \nand you don’t want him to see what you have in there?  I would get suspicious right away, boy.  Yes.  And I feel \nthat that worked very well, but I cannot set a law.  My hands are tied.  I cannot set a law.   \n \nPeople  become  addicted.  They  become  obsessed  with  the  internet,  so  they  want  two  phones and  the \nyoung girl want one phone and mother must not see what she has. “She is rude and out of place to interfere in \nmy business.” She has an unsaved man’s picture in there.  She snapped her body and sent it out and is hiding it \nthere.  You rule  your house to suite. America, rule  your house to suite. Africa, rule  your house to suite. India, \nrule your house to suite.  As for me and my house, we will serve the Lord.  It is beyond my control.   \n \nCome musicians. I am holding the people too long, but it was enjoyable.  I believe it brought out things \nthat you never anticipated and you never thought about the danger.  I have confidence in your sincerity that you \nwill start putting these things in place.  Why do you want so many phones?  Why do you want to pay so much?  \nWhat are you doing?  You are so busy that you cannot cook your husband’s food, you cannot sit down and talk \nto him because  you have a chat box.  Let us adjust some of these things.  If we love our children and we love \nour  wives, I  have  full  trust  in  most  of  the  sisters  here.  Yes,  I  honor  my  sisters. I  believe  that  they  are  doing \nright. But it is a dangerous thing.  It is a box of temptation.  That has cut down prayer. It has cut down the tapes. \nIt  has  cut  down  dedication.  And  as  for  these chat  groups, I don’t believe in them.  All  these  chat groups are \ngossip going from one to the other. It is going from church to church and I am against all chat groups. What are \nyou talking? “Church business.” People’s business.  Away with such things!  They say, “We will do it for the \nministers.”  It is not needed.  You will make interpretations. That is what you will do. \n \nSet  your  house  in  order, man.   It is the  most  dangerous  tool  that  has ever  entered  the  church,  has ever \nentered your home and has ever came into your hands as an individual.  You have to be born again to control it. \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   21 \nYou must have  a revelation  to  control  it. The  impact  of  the Word  has to  be  stronger  than  the  impact  of  the \nworld.  Yes.  Let me put this in here before I forget. \n \n \n \n\n[p18]\n\nCARNAL WAY OF SETTLING OFFENCES BY PUTTING TEXTS ON PHONE \n \nDo you know what people are doing on the phones?  When they have offences, instead of settling their \noffences with one  another, they have a text that they  write, indicating that person, indicating the other person, \nand  that  is  attacking  that  person  or  throwing  off  something  at  that  person  because  they  are  offended  in  that \nperson.  And  there are wars that  goes  on  right  in  our  midst, of  people sending  those  things  there.  And  these \nresearches that you are finding about angels flying in the skies and all these other nonsense, don’t sent them to \nme.  Home and abroad, don’t send them. I don’t have time with such.  If it is something useful for the church, it \nis different.  Yes.  Don’t send those nonsense to me.  I don’t have time for it.  Yes.  I have the use of my phone \nfor only God.  I don’t look and peep at pornography.  No, no, no.  I don’t go out here and put up some text to \ninsult somebody. That is going on and we caught a few of them with that and they were honest.  I said, “Why \ndid you put that there?” “I was throwing off at that sister.  I was throwing off at that brother”, sending insulting \nwords. \n \nAnother thing they do, they have a nice little text, smart mouth text that they pick out from the internet \nand they have it on their phone.  Everywhere they send that message, it is recorded there.  Where is your Bible?  \nWhere are Brother Branham’s quotes?  Where is your own words of love and appreciation and knowledge and \nwisdom?  Why do you have to borrow from worldly people, and some of them don’t make sense to me.  What \nthey  are saying is not right.  It is perverted.  Yes, and then  you want to borrow from the ungodly,  you want to \nborrow a picture from here. They are nice, some of them. And you want to borrow the slang from over there and \nsay  this  to  insult  the  person  that  you  are  talking  to.  There are a lot  that  goes  with  it  and  you  may  not  be \nacquainted with them, but I searched it out before I came here.  I had to learn this by force, for several years, to \ncommunicate with the world and to know what is going on in people’s homes. \n \nI  am  against  all  these  practices  of  settling  offences  with  one  another  by throwing  off  slangs, by \nthrowing off, and I could bring  you up to the pulpit for that.  If that is proven and that is the way you learn to \nsettle your offences, it is unscriptural and we could make some issues about this.  Anybody who is insulted by \nanybody’s texts, you bring the matter to the church.  We will deal with that.   \n \nI  trust  that  you  have  learnt  some things.  Oh  yes!  That is  my  contribution.  My  hands  are  tied  and  the \nchurch’s hand is  tied.    All  that  I  could do is  to  preach  the  Word  of  God  and  leave  it  to  your sincerity  and \nhonesty.  Yes.  If you are disobedient, it is going to take you through the tribulation. But if you are obedient, ye \nshall eat the good of the land. And if you are disobedient, you shall be devoured with the sword.  Yes.  Thank \nyou for your patience. I ran over time.  Let us stand, brethren.  Give us a song. \n \nChange my heart oh God,  \nmake it ever true.   \nChange my heart oh Lord,  \nmay I be like you!  \n \nYou are the Potter, \nI am the clay. \nMold me and make me, \nThis is what I pray \n\nMy Soul’s Inventory (Internet Obsession & Cell Phone Addiction)                                                                   22 \n \nChange my heart oh God,  \nmake it ever true.   \nChange my heart oh Lord,  \nmay I be like you!  \n ",
      "date": "",
      "place": "",
      "duration": "",
      "id": 8
    }
  ],
  "categories": [
    {
      "name": "books",
      "level": "1",
      "description": "books",
      "id": 1
    },
    {
      "name": "booklets",
      "level": "2",
      "description": "booklets",
      "id": 2
    },
    {
      "name": "tracts",
      "level": "3",
      "description": "tracts",
      "id": 3
    }
  ],
  "highlighters": [],
  "styledselections": [],
  "commentedselections": [],
  "texttospeech": [],
  "searchterms": []
}